In [3]:
import pandas as pd

In [4]:
# df= pd.read_csv('data/gb_sem_8_cw.csv')

In [5]:
df = pd.read_excel('data/gb_sem_8_hm.xlsx')

d:\Mytraining\.venv.AB.Testing\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [6]:
df.head()

   USER_ID VARIANT_NAME  REVENUE
0      737      variant      0.0
1     2423      control      0.0
2     9411      control      0.0
3     7311      control      0.0
4     6174      variant      0.0

In [7]:
df.nunique()

USER_ID         6324
VARIANT_NAME       2
REVENUE          101
dtype: int64

In [8]:
 df.groupby('USER_ID', as_index=False).agg({'VARIANT_NAME': 'count'})['VARIANT_NAME'].value_counts()

VARIANT_NAME
1    3664
2    1890
3     570
4     159
5      36
6       5
Name: count, dtype: int64

In [9]:
df.shape

(10000, 3)

In [10]:
df.describe()

            USER_ID       REVENUE
count  10000.000000  10000.000000
mean    4981.080200      0.099447
std     2890.590115      2.318529
min        2.000000      0.000000
25%     2468.750000      0.000000
50%     4962.000000      0.000000
75%     7511.500000      0.000000
max    10000.000000    196.010000

In [11]:
df.value_counts()

USER_ID  VARIANT_NAME  REVENUE
5652     control       0.0        6
1782     control       0.0        5
1184     control       0.0        4
8359     variant       0.0        4
8357     variant       0.0        4
                                 ..
4605     variant       0.0        1
         control       0.0        1
4602     control       0.0        1
4600     variant       0.0        1
4965     control       0.0        1
Name: count, Length: 7933, dtype: int64

In [12]:
df.groupby(['USER_ID'])['VARIANT_NAME'].value_counts
df

      USER_ID VARIANT_NAME  REVENUE
0         737      variant      0.0
1        2423      control      0.0
2        9411      control      0.0
3        7311      control      0.0
4        6174      variant      0.0
...       ...          ...      ...
9995     1981      control      0.0
9996      502      variant      0.0
9997     9214      variant      0.0
9998     7741      control      0.0
9999     9468      control      0.0

[10000 rows x 3 columns]

In [22]:
a = df.\
      groupby('USER_ID', as_index=False).\
      agg({'VARIANT_NAME': pd.Series.nunique})
a.head()

   USER_ID  VARIANT_NAME
0        2             1
1        3             2
2        4             1
3        5             1
4        6             1

In [24]:
more_than_one_types = a.query('USER_ID >1')

more_than_one_types

      USER_ID  VARIANT_NAME
0           2             1
1           3             2
2           4             1
3           5             1
4           6             1
...       ...           ...
6319     9993             1
6320     9995             1
6321     9996             2
6322     9998             1
6323    10000             2

[6324 rows x 2 columns]

In [25]:

df_new = df[df.USER_ID.isin(more_than_one_types.USER_ID)&(~)].sort_values('USER_ID')
df_new

      USER_ID VARIANT_NAME  REVENUE
2406        2      control      0.0
3479        2      control      0.0
7076        2      control      0.0
7409        3      variant      0.0
4145        3      variant      0.0
...       ...          ...      ...
2998     9996      control      0.0
1064     9998      control      0.0
8970    10000      variant      0.0
8921    10000      control      0.0
6883    10000      variant      0.0

[10000 rows x 3 columns]

In [20]:
df_new.describe()

           USER_ID      REVENUE
count  6070.000000  6070.000000
mean   4983.664086     0.107064
std    2897.990118     2.673501
min       2.000000     0.000000
25%    2472.250000     0.000000
50%    4950.000000     0.000000
75%    7501.000000     0.000000
max    9998.000000   196.010000